// pages/discover_detail/discover_detail.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    interval: 5000,
    duration: 1000,
    indicatorDots: false,
    autoplay: false,
    imageUrl: [
      { id: 1, url: 'http://p95v2ft9v.bkt.clouddn.com/mall/%E6%96%B0%E5%93%81%E9%A6%96%E5%8F%91@2x.png' },
      { id: 2, url: 'http://p95v2ft9v.bkt.clouddn.com/mall/%E6%96%B0%E5%93%81%E9%A6%96%E5%8F%91@2x.png' },
      { id: 3, url: 'http://p95v2ft9v.bkt.clouddn.com/mall/%E6%96%B0%E5%93%81%E9%A6%96%E5%8F%91@2x.png' }
    ],
    list: [
      {
        id: 1,
        label: '黄渍',
        item_hasbgr: 'item_hasbgr',
        text: [
          "1、衣物浸泡在淘米水中，煮十余分钟；或将橘子皮放入锅内加水烧煮后，将衣服浸泡其中搓洗。", "2、流汗产生的黄渍，可以在洗涤时加入约2汤匙的氨水，浸泡几分钟后，搓洗再用清水洗净。", "3、将一块冬瓜捣烂，将其液汁挤出，用来搓洗沾有汗渍的衣服，然后再用清水漂净。"
        ]
      },
      {
        id: 2,
        label: '圆珠笔',
        text: [
          "1、可用洗发水浸透污处，再将白醋加水稀释，用刷子蘸上溶液轻轻擦洗，污垢可除。",
          "2、用布条浸浓度不小于75 % 的医用酒精轻轻擦拭污处即可去掉。",
          "3、将污渍用冷水浸湿后，涂些牙膏，抹少量肥皂轻轻搓揉，如有痕迹，再用酒精擦拭即可。"
        ]
      },
      {
        id: 3,
        label: '墨水渍',
        text: [
          "1、可用饭粒和洗涤剂调匀，涂在污渍部分搓擦，再用清水漂洗干净；",
          "2、可用一份酒精、二份肥皂制的溶液反复涂擦，亦有良好效果；",
          "3、陈渍先用温洗涤液洗一遍，再把酒精、肥皂、牙膏混合制成的糊状物涂在污处，反复揉搓。"
        ]
      },
      {
        id: 4,
        label: '咖啡渍',
        text: [
          "1、不浓的咖啡迹可用肥皂或洗衣粉浸入热水中清洗干净。",
          "2、较浓需在鸡蛋黄内洒入少许甘油混合后涂抹在污迹处，待稍干后再用肥皂及热水清洗咖啡污迹可清除干净。",
          "3、羊毛混纺织品上的咖啡渍，可用10 % 的甘油溶液洗涤。 白衬衣上的可用苏打水擦拭。"
        ]
      },
      {
        id: 5,
        label: '酒渍',
        text: [
          "1、啤酒和白酒陈渍可用肥皂水，松节油，氨水10：2：1的混合液擦拭后用清水冲净。白衬衣酒渍可用煮滚的奶擦拭。",
          "2、化纤织物沾了白酒、啤酒渍，可以先用酒精浸润，再加甘油轻擦，一小时后用水冲净。啤酒渍必须用温水才能洗净。",
          " 3、刚染上的红酒渍，往酒渍上洒厚厚一层盐巴。陈旧红酒渍可用肥皂10份、松节油2份、氨水1份混合擦拭，后用清水冲净。"
        ]
      },
      {
        id: 6,
        label: '茶渍',
        text: [
          "2、旧茶迹，可用甘油和蛋黄混合溶液擦拭，稍干后用清水漂净。或在污渍处涂上甘油，再撒上几粒硼砂，用开水浸洗。亦可用稀释的氨水、硼砂加温水擦拭。",
          "2、用布条浸浓度不小于75 % 的医用酒精轻轻擦拭污处即可去掉。",
          "3、衣服洒上茶水，可立即用70 - 80°的热水洗涤，便可洗净。"
        ]
      }, {
        id: 7,
        label: '油渍',
        text: [
          "1、刚刚弄到的油渍，我们立即用洗洁精擦一下，用手搓揉几下，一般都可以去除。",
          " 2、衣服上被油沾染后，挤点牙膏于渍处，轻轻擦几次，再用清水搓洗，油污即可清除。",
          "3、衣服上染上烟筒油渍要立即用汽油擦洗（从污迹外部往里擦洗，避免污迹扩大）或用温皂液洗涤。"
        ]
      },
      {
        id: 8,
        label: '血渍',
        text: [
          "1、刚沾染上时，可先用冷清水或淡盐水浸泡几分钟，切忌用热水，然后用肥皂或酒精洗涤。",
          "2、可用柠檬汁加盐水除掉血渍，也可用白萝卜汁或捣碎的胡萝卜拌盐去除。用加酶洗衣粉除去血渍，效果甚佳。",
          "3、若沾污时间较长，可用10 % 的氨水或3 % 的双氧水揩拭污处，过一会儿，再用冷水强洗。"
        ]
      },
      {
        id: 9,
        label: '霉渍',
        text: [
          "1、把衣服放入洗米水中浸泡一夜后，再按常规搓洗，霉斑就可除去。",
          "2、将衣服放在加有少量醋和牛奶的水中搓洗一遍，便能除去霉味。",
          "3、衣物上的霉斑可先在日光下暴晒，后用刷子清霉毛，再用酒精洗除，或用绿豆芽搓洗。"
        ],
      },
      {
        id: 10,
        label: '果汁',
        text: [
          "1、新染上的果汁，可先撒些食盐，轻轻地用水润湿，然后浸在肥皂水中洗涤。",
          "2、轻微的果渍可用冷水洗除，一次洗不净，再洗直到洗净为止。污染较重的，可用稀氨水来中和果汁中的有机酸，再用肥皂洗净。呢绒衣服可用酒石酸溶液清洗。丝绸可用柠檬酸或用肥皂、酒精溶液来搓洗。",
          "3、在果汁渍上滴几滴食醋，用手揉搓几次，再用清水洗净。"
        ]
      }
    ],
    result: {
      text: [
        "1、衣物浸泡在淘米水中，煮十余分钟；或将橘子皮放入锅内加水烧煮后，将衣服浸泡其中搓洗。",
        "2、流汗产生的黄渍，可以在洗涤时加入约2汤匙的氨水，浸泡几分钟后，搓洗再用清水洗净。",
        "3、将一块冬瓜捣烂，将其液汁挤出，用来搓洗沾有汗渍的衣服，然后再用清水漂净。"
      ]
    }

  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  },

  showResult: function (event) {
    for (var i = 0; i < this.data.list.length; i++) {
      if (this.data.list[i].id == event.currentTarget.dataset.id) {
        this.data.list[i].item_hasbgr = 'item_hasbgr';
        this.setData({
          result: {
            text: this.data.list[i].text
          }
        })
      } else {
        this.data.list[i].item_hasbgr = '';
      }
    }
    this.setData({
      list: this.data.list
    })
  }
})